app/controllers/api/v1/budgets_controller.rb

SELECT "budgets".* FROM "budgets" WHERE (user_id = 1)
---
  def index
    @budgets = Budget.where('user_id = ?', current_user.id)

SELECT "budgets".* FROM "budgets" WHERE "budgets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @budget = Budget.find(params[:id])

INSERT INTO "budgets" ("name", "start_date", "end_date", "income", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @budget = current_user.budgets.build(budget_params)
    if @budget.save

SELECT "budgets".* FROM "budgets" WHERE "budgets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "budgets" WHERE "budgets"."id" = $1  [["id", 1]]
---
  def destroy
    @budget = Budget.find(params[:id])
    @budget.destroy